In [1]:
import pandas as pd

In [11]:
df_csv = pd.read_csv('student_marks.csv')

In [3]:
df_csv

     Student_Name  Maths  Physics  Chemistry  Computer_Science
0     Arjun Singh   49.0     55.0       48.0              80.0
1       Arjun Das   94.0     98.0       45.0              68.0
2    Vivaan Singh   95.0     40.0        NaN              49.0
3    Vivaan Patel   85.0      NaN       47.0               NaN
4       Sai Gupta    NaN      NaN        NaN              92.0
5     Aarav Mehta   87.0      NaN       78.0              66.0
6    Suresh Gupta   70.0     92.0        NaN               NaN
7    Aditya Patel   51.0     40.0        NaN              47.0
8     Rahul Reddy    NaN     51.0        NaN              83.0
9     Rahul Singh    NaN     56.0       90.0              55.0
10    Rahul Kumar    NaN      NaN       46.0               NaN
11        Sai Das   52.0      NaN        NaN               NaN
12  Karthik Reddy   36.0      NaN       83.0               NaN
13  Aditya Sharma   72.0     87.0        NaN               NaN
14   Nikhil Patel    NaN      NaN        NaN              76.0
15    Aarav Reddy    NaN      NaN       89.0              63.0
16    Rahul Singh   73.0     37.0        NaN              92.0
17  Karthik Kumar    NaN     68.0       63.0              58.0
18    Rahul Mehta   75.0     72.0        NaN              38.0
19    Vivaan Iyer   95.0      NaN        NaN               NaN
20      Sai Gupta   37.0      NaN       47.0              53.0
21    Rohan Verma    NaN      NaN        NaN               NaN
22    Arjun Gupta    NaN     49.0        NaN              98.0
23    Rohan Singh    NaN     50.0        NaN              67.0
24    Aarav Gupta    NaN     99.0        NaN              55.0
25   Suresh Kumar   90.0     64.0        NaN               NaN
26   Aditya Mehta   59.0     85.0       39.0              76.0
27    Aditya Iyer    NaN     78.0       92.0               NaN
28     Arjun Iyer   93.0     91.0        NaN               NaN
29  Karthik Gupta    NaN      NaN        NaN              88.0
30   Vivaan Patel   47.0      NaN        NaN              98.0
31     Sai Sharma    NaN     42.0        NaN               NaN
32   Vivaan Verma    NaN      NaN        NaN              98.0
33    Rahul Singh    NaN      NaN        NaN              88.0
34    Rahul Verma   43.0      NaN       77.0               NaN
35   Aditya Singh    NaN      NaN       60.0              57.0
36    Arjun Gupta   35.0     41.0        NaN              88.0
37    Rohan Verma   36.0      NaN        NaN              38.0
38    Aarav Gupta    NaN      NaN        NaN               NaN
39   Suresh Mehta    NaN      NaN       35.0              73.0
40   Suresh Gupta   49.0     98.0       48.0               NaN
41   Aditya Verma   75.0      NaN        NaN               NaN
42      Rohan Das    NaN     92.0       82.0              56.0
43    Arjun Verma   39.0     56.0       57.0               NaN
44  Karthik Kumar   52.0      NaN       69.0              62.0
45   Suresh Kumar    NaN     94.0        NaN               NaN
46   Nikhil Verma   90.0      NaN        NaN              93.0
47      Arjun Das    NaN      NaN        NaN              49.0
48    Rohan Gupta   37.0      NaN        NaN              85.0
49    Aarav Reddy    NaN     44.0        NaN               NaN

In [4]:
with open('sample_data.csv','w') as f:
    f.write('''ID;Name;Age
    1;Alice;24
    2;bob;30''')

In [5]:
df_sample_csv = pd.read_csv('sample_data.csv', delimiter =';')

In [6]:
df_sample_csv

   ID   Name  Age
0   1  Alice   24
1   2    bob   30

In [7]:
df1 = pd.read_csv('student_marks.csv',
                 nrows = 3,
                 # usecols = ['Student_Name','Physics'],
                 skiprows = 1,
                 na_values = [''])

In [8]:
df1

    Arjun Singh  49    55    48    80
0     Arjun Das  94  98.0  45.0  68.0
1  Vivaan Singh  95  40.0   NaN  49.0
2  Vivaan Patel  85   NaN  47.0   NaN

In [3]:
df_excel = pd.DataFrame({
    'Product':['Laptop','Mouse','KeyBoard','Monitor'],
    'Price':[999.99,29.99,59.99,299.99],
    'Quantity':[10,50,30,15],
    'Category':['Electronics','Accessories','Accessories','Electronics']
})

In [4]:
df_excel.to_excel('sample_data.xlsx', index = False,sheet_name = 'Products')

In [5]:
df_from = pd.read_excel('sample_data.xlsx')

In [8]:
df_from

    Product   Price  Quantity     Category
0    Laptop  999.99        10  Electronics
1     Mouse   29.99        50  Accessories
2  KeyBoard   59.99        30  Accessories
3   Monitor  299.99        15  Electronics

In [9]:
df_sheet = pd.read_excel('student_marks.xlsx')

In [10]:
df_sheet

     Student_Name  Maths  Physics  Chemistry  Computer_Science
0     Arjun Singh    NaN     55.0        NaN              80.0
1       Arjun Das   94.0      NaN        NaN               NaN
2    Vivaan Singh   95.0     40.0        NaN              49.0
3    Vivaan Patel   85.0      NaN       47.0               NaN
4       Sai Gupta    NaN      NaN        NaN              92.0
5     Aarav Mehta   87.0      NaN       78.0              66.0
6    Suresh Gupta   70.0     92.0        NaN               NaN
7    Aditya Patel   51.0     40.0        NaN              47.0
8     Rahul Reddy    NaN     51.0        NaN              83.0
9     Rahul Singh    NaN     56.0       90.0              55.0
10    Rahul Kumar    NaN      NaN       46.0               NaN
11        Sai Das   52.0      NaN        NaN               NaN
12  Karthik Reddy   36.0      NaN       83.0               NaN
13  Aditya Sharma   72.0     87.0        NaN               NaN
14   Nikhil Patel    NaN      NaN        NaN              76.0
15    Aarav Reddy    NaN      NaN       89.0              63.0
16    Rahul Singh   73.0     37.0        NaN              92.0
17  Karthik Kumar    NaN     68.0       63.0              58.0
18    Rahul Mehta   75.0     72.0        NaN              38.0
19    Vivaan Iyer   95.0      NaN        NaN               NaN
20      Sai Gupta   37.0      NaN       47.0              53.0
21    Rohan Verma    NaN      NaN        NaN               NaN
22    Arjun Gupta    NaN     49.0        NaN              98.0
23    Rohan Singh    NaN     50.0        NaN              67.0
24    Aarav Gupta    NaN     99.0        NaN              55.0
25   Suresh Kumar   90.0     64.0        NaN               NaN
26   Aditya Mehta   59.0     85.0       39.0              76.0
27    Aditya Iyer    NaN     78.0       92.0               NaN
28     Arjun Iyer   93.0     91.0        NaN               NaN
29  Karthik Gupta    NaN      NaN        NaN              88.0
30   Vivaan Patel   47.0      NaN        NaN              98.0
31     Sai Sharma    NaN     42.0        NaN               NaN
32   Vivaan Verma    NaN      NaN        NaN              98.0
33    Rahul Singh    NaN      NaN        NaN              88.0
34    Rahul Verma   43.0      NaN       77.0               NaN
35   Aditya Singh    NaN      NaN       60.0              57.0
36    Arjun Gupta   35.0     41.0        NaN              88.0
37    Rohan Verma   36.0      NaN        NaN              38.0
38    Aarav Gupta    NaN      NaN        NaN               NaN
39   Suresh Mehta    NaN      NaN       35.0              73.0
40   Suresh Gupta   49.0     98.0       48.0               NaN
41   Aditya Verma   75.0      NaN        NaN               NaN
42      Rohan Das    NaN     92.0       82.0              56.0
43    Arjun Verma   39.0     56.0       57.0               NaN
44  Karthik Kumar   52.0      NaN       69.0              62.0
45   Suresh Kumar    NaN     94.0        NaN               NaN
46   Nikhil Verma   90.0      NaN        NaN              93.0
47      Arjun Das    NaN      NaN        NaN              49.0
48    Rohan Gupta   37.0      NaN        NaN              85.0
49    Aarav Reddy    NaN     44.0        NaN               NaN

In [13]:
with pd.ExcelWriter('sample.xlsx') as writer:
    df_excel.to_excel(writer,sheet_name = 'Products',index = False)

    df_sales = pd.DataFrame({
    'Month':['Jan','Feb','Mar'],
    'Sales':[15000,22000,18000],
    'Expenses':[8000,12000,9000]
    })
    df_sales.to_excel(writer,sheet_name='Sales',index = False)

In [14]:
xls = pd.ExcelFile('sample.xlsx')

In [16]:
print(xls)

<pandas.ExcelFile object at 0x000002082BE29CD0>

In [17]:
xls.sheet_names

['Products', 'Sales']

In [18]:
df_products = pd.read_excel(xls,sheet_name='Products')

In [19]:
df_products

    Product   Price  Quantity     Category
0    Laptop  999.99        10  Electronics
1     Mouse   29.99        50  Accessories
2  KeyBoard   59.99        30  Accessories
3   Monitor  299.99        15  Electronics

In [20]:
df_sales = pd.read_excel(xls,sheet_name = 'Sales')

In [21]:
df_sales

  Month  Sales  Expenses
0   Jan  15000      8000
1   Feb  22000     12000
2   Mar  18000      9000

In [22]:
df_selected = pd.read_excel('sample.xlsx',usecols=['Product','Price'])

In [23]:
df_selected

    Product   Price
0    Laptop  999.99
1     Mouse   29.99
2  KeyBoard   59.99
3   Monitor  299.99

In [24]:
df_limited = pd.read_excel('sample.xlsx',nrows=2)

In [25]:
df_limited

  Product   Price  Quantity     Category
0  Laptop  999.99        10  Electronics
1   Mouse   29.99        50  Accessories